let handler = async (m, { conn, command, args }) => {
let texto = ''

switch (command) {

case 'spam':
texto = `ㅤ❗ *𝑷𝒓𝒆𝒄𝒊𝒐𝒔 𝒅𝒆 𝒔𝒑𝒂𝒎* 🩵

*3 dias* / 5.50🇵🇪 1750🇨🇱 2600🇦🇷 75🇺🇾 22.5🇧🇴 7.500🇨🇴 2🇺🇸 37.5🇲🇽

*5 dias* / 7.50🇵🇪 2450🇨🇱 3640🇦🇷 105🇺🇾 31.5🇧🇴 10.500🇨🇴 3🇺🇸 52.5🇲🇽

*1 semana* / 9.50🇵🇪 3150🇨🇱 4680🇦🇷 135🇺🇾 40.5🇧🇴 13.500🇨🇴 4🇺🇸 67.5🇲🇽

_𝘔𝘢𝘴 𝘪𝘯𝘧𝘰𝘳𝘮𝘢𝘤𝘪ó𝘯:_ _𝘌𝘭 𝘴𝘱𝘢𝘮 𝘦𝘴 𝘹𝟥 𝘩𝘰𝘳𝘢𝘴 𝘢𝘭 𝘥𝘪𝘢, 𝘴𝘪 𝘱𝘢𝘨𝘢𝘯 𝘦𝘭 𝘴𝘦𝘳𝘷𝘪𝘤𝘪𝘰 𝘦𝘯 𝘭𝘢 𝘵𝘢𝘳𝘥𝘦 𝘰 𝘯𝘰𝘤𝘩𝘦 𝘴𝘶 𝘴𝘱𝘢𝘮 𝘴𝘦 𝘪𝘯𝘪𝘤𝘪𝘢 𝘢𝘭 𝘥𝘪𝘢 𝘴𝘪𝘨𝘶𝘪𝘦𝘯𝘵𝘦, 𝘱𝘦𝘳𝘰 𝘴𝘪 𝘱𝘢𝘨𝘢𝘯 𝘱𝘰𝘳 𝘭𝘢 𝘮𝘢ñ𝘢𝘯𝘢 𝘴𝘦 𝘦𝘮𝘱𝘪𝘦𝘻𝘢 𝘦𝘭 𝘮𝘪𝘴𝘮𝘰 𝘥𝘪𝘢, 𝘦𝘭 𝘴𝘱𝘢𝘮 𝘦𝘴 𝘱𝘶𝘳𝘰 𝘵𝘦𝘹𝘵𝘰 𝘶𝘴𝘵𝘦𝘥 𝘮𝘢𝘯𝘥𝘢 𝘺 𝘦𝘴 𝘦𝘭 𝘮𝘪𝘴𝘮𝘰 𝘵𝘦𝘹𝘵𝘰 𝘲𝘶𝘦 𝘴𝘦 𝘴𝘱𝘢𝘮𝘦𝘢 (𝘯𝘰 𝘮𝘰𝘥𝘪𝘧𝘪𝘤𝘰 𝘯𝘢𝘥𝘢 𝘥𝘦 𝘴𝘶 𝘵𝘦𝘹𝘵𝘰 𝘴𝘦 𝘴𝘱𝘢𝘮𝘦𝘢 𝘵𝘢𝘭 𝘤𝘶𝘢𝘭 𝘮𝘢𝘯𝘥𝘰)._

💳 *Para comprar:* Usa \`.owner\``
break

case 'design':
texto = `🖌️ *𝙋𝙧𝙚𝙘𝙞𝙤𝙨 𝙇𝙪 𝙙𝙚𝙨𝙞𝙜𝙣* 🩵

^^ *𝘛𝘦𝘹 𝘓𝘰𝘨𝘰 𝘺 𝘓𝘰𝘨𝘰𝘴:*
3🇵🇪 1050🇨🇱 1560🇦🇷 22.5🇲🇽22.5🇺🇾 13.5🇧🇴 4500🇨🇴 2🇺🇸

^^ *𝘗𝘭𝘢𝘯𝘵𝘪𝘭𝘢𝘴 𝟤𝘹𝟣:*
4🇵🇪 1050🇨🇱 1560🇦🇷 22.5🇲🇽22.5🇺🇾 13.5🇧🇴 4500🇨🇴 2🇺🇸

^^ *𝘊𝘢𝘭𝘪𝘨𝘳á𝘧𝘪𝘤𝘰𝘴 𝟤𝘹𝟣:*
3🇵🇪 1050🇨🇱 1560🇦🇷 22.5🇲🇽22.5🇺🇾 13.5🇧🇴 4500🇨🇴 2🇺🇸

^^ *𝘑𝘦𝘳𝘴𝘦𝘺:*
5🇵🇪 1750🇨🇱 2600🇦🇷 75🇺🇾 22.5🇧🇴 7.500🇨🇴 2🇺🇸 37.5🇲🇽

_𝘔𝘢𝘴 𝘐𝘯𝘧𝘰𝘳𝘮𝘢𝘤𝘪ó𝘯:_ _𝘦𝘭 𝘱𝘦𝘥𝘪𝘥𝘰 𝘥𝘦𝘮𝘰𝘳𝘢 𝘮𝘢𝘹𝘪𝘮𝘰 𝟤 𝘥𝘪𝘢𝘴, 𝘯𝘰 𝘩𝘢𝘨𝘰 𝘥𝘦𝘷𝘰𝘭𝘶𝘤𝘪𝘰𝘯𝘦𝘴 𝘯𝘪 𝘢𝘤𝘦𝘱𝘵𝘰 𝘧𝘢𝘭𝘵𝘢𝘴 𝘥𝘦 𝘳𝘦𝘴𝘱𝘦𝘵𝘰, 𝘳𝘦𝘴𝘱𝘰𝘯𝘥𝘰 𝘮𝘦𝘯𝘴𝘢𝘫𝘦𝘴 𝘦𝘯 𝘭𝘢𝘴 𝘵𝘢𝘳𝘥𝘦𝘴 𝘺 𝘯𝘰𝘤𝘩𝘦𝘴 (𝘦𝘯 𝘭𝘢𝘴 𝘮𝘢ñ𝘢𝘯𝘢𝘴 𝘴𝘶𝘦𝘭𝘰 𝘳𝘦𝘴𝘱𝘰𝘯𝘥𝘦𝘳 𝘱𝘦𝘳𝘰 𝘯𝘰 𝘵𝘰𝘥𝘰𝘴 𝘭𝘰𝘴 𝘥𝘪𝘢𝘴)_

💳 *Para comprar:* Usa \`.owner\``
break

case 'diamantes':
let pais = args[0]?.toLowerCase() || ''
let info = `
𝘔𝘢𝘴 𝘐𝘯𝘧𝘰𝘳𝘮𝘢𝘤𝘪ó𝘯: 𝘗𝘢𝘳𝘢 𝘴𝘢𝘣𝘦𝘳 𝘵𝘶 𝘴𝘵𝘰𝘤𝘬 𝘮𝘢𝘯𝘥𝘢𝘳𝘮𝘦 𝘴𝘶 𝘪𝘥 𝘱𝘢𝘳𝘢 𝘷𝘦𝘳𝘪𝘧𝘪𝘤𝘢𝘳, 𝘭𝘢𝘴 𝘳𝘦𝘤𝘢𝘳𝘨𝘢𝘴 𝘦𝘯 𝘭𝘢𝘴 𝘮𝘢ñ𝘢𝘯𝘢𝘴 𝘺 𝘯𝘰𝘤𝘩𝘦𝘴 (𝘵𝘢𝘳𝘥𝘦𝘴 𝘯𝘰 𝘴𝘶𝘦𝘭𝘰 𝘳𝘦𝘴𝘱𝘰𝘯𝘥𝘦𝘳 𝘮𝘶𝘤𝘩𝘰 𝘢𝘴𝘪 𝘲𝘶𝘦 𝘯𝘰 𝘴𝘦 𝘦𝘴𝘵𝘳𝘦𝘴𝘦𝘯 𝘴𝘪 𝘯𝘰 𝘳𝘦𝘴𝘱𝘰𝘯𝘥𝘰 𝘪𝘯𝘮𝘦𝘥𝘪𝘢𝘵𝘢𝘮𝘦𝘯𝘵𝘦)

💳 *Para comprar:* Usa \`.owner\``

if(pais === 'peru'){
texto = `🇵🇪 *𝑷𝒓𝒆𝒄𝒊𝒐𝒔 𝒅𝒆 𝑫𝒊𝒂𝒎𝒂𝒏𝒕𝒆𝒔* 🇵🇪
         ❗*𝘊𝘰𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 S/2.50
341💎 S/7.00
572💎 S/12.00
1166💎 S/20.00
2398💎 S/36.00
6160💎 S/92.00

          ❗*𝘚𝘪𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 S/3.50
341💎 S/10.00
572💎 S/15.00
1166💎 S/26.00
2398💎 S/52.00
6160💎 S/126.00` + info
}
else if(pais === 'chile'){
texto = `🇨🇱 *𝑷𝒓𝒆𝒄𝒊𝒐𝒔 𝒅𝒆 𝑫𝒊𝒂𝒎𝒂𝒏𝒕𝒆𝒔* 🇨🇱
         ❗*𝘊𝘰𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 $875
341💎 $2.450
572💎 $4.200
1166💎 $7.000
2398💎 $12.600
6160💎 $32.200

          ❗*𝘚𝘪𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 $1.225
341💎 $3.500
572💎 $5.250
1166💎 $9.100
2398💎 $18.200
6160💎 $44.100` + info
}
else if(pais === 'argentina'){
texto = `🇦🇷 *𝑷𝒓𝒆𝒄𝒊𝒐𝒔 𝒅𝒆 𝑫𝒊𝒂𝒎𝒂𝒏𝒕𝒆𝒔* 🇦🇷
         ❗*𝘊𝘰𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 $1.300
341💎 $3.380
572💎 $5.720
1166💎 $9.880
2398💎 $18.200
6160💎 $46.800

          ❗*𝘚𝘪𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 $1820
341💎 $4.680
572💎 $7.800
1166💎 $13.520
2398💎 $27.040
6160💎 $65.520` + info
}
else if(pais === 'mexico'){
texto = `🇲🇽 *𝑷𝒓𝒆𝒄𝒊𝒐𝒔 𝒅𝒆 𝑫𝒊𝒂𝒎𝒂𝒏𝒕𝒆𝒔* 🇲🇽
         ❗*𝘊𝘰𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 $18.75
341💎 $52.50
572💎 $90
1166💎 $150
2398💎 $270
6160💎 $690

          ❗*𝘚𝘪𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 $26.25
341💎 $75
572💎 $112.5
1166💎 $195
2398💎 $390
6160💎 $945` + info
}
else if(pais === 'bolivia'){
texto = `🇧🇴 *𝑷𝒓𝒆𝒄𝒊𝒐𝒔 𝒅𝒆 𝑫𝒊𝒂𝒎𝒂𝒏𝒕𝒆𝒔* 🇧🇴
         ❗*𝘊𝘰𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 $11.25
341💎 $31.5
572💎 $54
1166💎 $90
2398💎 $162
6160💎 $414

          ❗*𝘚𝘪𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 $15.75
341💎 $45
572💎 $67.5
1166💎 $117
2398💎 $234
6160💎 $567` + info
}
else if(pais === 'uruguay'){
texto = `🇺🇾 *𝑷𝒓𝒆𝒄𝒊𝒐𝒔 𝒅𝒆 𝑫𝒊𝒂𝒎𝒂𝒏𝒕𝒆𝒔* 🇺🇾
         ❗*𝘊𝘰𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 $37.5
341💎 $105
572💎 $180
1166💎 $300
2398💎 $540
6160💎 $1.380

          ❗*𝘚𝘪𝘯 𝘚𝘵𝘰𝘤𝘬* ❗
110💎 $52.5
341💎 $150
572💎 $225
1166💎 $390
2398💎 $780
6160💎 $1.890` + info
}
else {
return conn.reply(m.chat, `📌 *Uso:*.diamantes [pais]\nPaises: peru, chile, argentina, mexico, bolivia, uruguay\n💳 *Para comprar:* Usa \`.owner\``, m)
}
break
}

await conn.reply(m.chat, texto, m)
}

handler.help = [
'spam | Servicio De Spam Masivo',
'design | Precios Luu Design',
'diamantes | Diamantes FF por país'
]
handler.tags = ['tienda']
handler.command = /^(spam|design|diamantes)$/i

export default handler